MENU_AVAILABLE = "Можете выбрать доступные команды"
NOT_REGISTERED = "Вы ещё не зарегистрированы.\nПожалуйста, начните с команды /start"
ENTER_SEARCH_QUERY = "🔍 Введите текст для поиска пользователей:"

MENU_RESPONSES = {
    "projects": "📁 Открываю ваши проекты...",
    "requests": "📨 Вот ваши заявки...",
    "search": "🔍 Введите ключевые слова для поиска",
    "journal": "📝 Ваш журнал активности",
    "stats": "📊 Загружаю статистику...",
    "settings": "⚙️ Открываю настройки",
    "unknown": "❓ Неизвестная команда."
}