SELECT_ROLE = "Выбери свою роль:"
SELECT_UNIVERSITY_STUDENT = (
    "Отлично! Теперь введите название своего учебного заведения.\n\n"
    "Например: МГУ"
)
SELECT_UNIVERSITY_TEACHER = (
    "Отлично! Теперь введите название научного учреждения, где Вы ведёте проекты.\n\n"
    "Например: МГУ"
)
SELECT_STAGE_STUDENT = "Укажите, на какой ступени обучения ты сейчас находишься:"
SELECT_STAGE_TEACHER = "Укажите свою научную или преподавательскую должность:"
REGISTRATION_SUCCESS = "Привет, {full_name}! 🎓 \nРегистрация завершена.\n\nРекомендую заполнить профиль подробнее командой /profile, можете сделать это позже в настройках\n\nТеперь Вам доступно меню"
REGISTRATTION_ERROR = "Произошла ошибка, попробуйте начать заново командой /start"