SELECT_ROLE = "Выбери свою роль:"
SELECT_UNIVERSITY_STUDENT = (
    "Отлично! Теперь введите название своего учебного заведения.\n\n"
    "Например: МГУ"
)
SELECT_UNIVERSITY_TEACHER = (
    "Отлично! Теперь введите название учебного заведения, где Вы ведёте научные работы или проекты.\n\n"
    "Например: МГУ"
)
SELECT_STAGE_STUDENT = "Укажи, на какой ступени обучения ты сейчас находишься:"
SELECT_STAGE_TEACHER = "Укажи свою научную или преподавательскую должность:"
REGISTRATION_SUCCESS = "Привет, {full_name}! 🎓 \nРегистрация завершена.\n\nТеперь Вам доступны команды"
REGISTRATTION_ERROR = "Произошла ошибка, попробуйте начать заново командой /start"