START_MESSAGE = (
    "Привет! 👋\n"
    "Я VKRTeamBot, Ваш помощник в организации работы над ВКР.\n\n"
    "Для начала введите своё ФИО:"
)
ALREADY_REGISTERED = (
    "Вы уже зарегистрированы! 🚀\n"
    "Введите /menu, чтобы перейти в главное меню."
)
SELECT_ROLE = "Выбери свою роль:"
SELECT_UNIVERSITY_STUDENT = (
    "Отлично! Теперь введите название своего учебного заведения.\n"
    "Например: Московский государственный университет"
)
SELECT_UNIVERSITY_TEACHER = (
    "Отлично! Теперь введите название учебного заведения, где Вы ведёте научные работы или проекты..\n"
    "Например: Московский государственный университет"
)
REGISTRATION_SUCCESS = "Привет, {full_name}! 🎓 \nРегистрация завершена."
SELECT_STAGE_STUDENT = "Укажи, на какой ступени обучения ты сейчас находишься:"
SELECT_STAGE_TEACHER = "Укажи свою научную или преподавательскую должность:"