SELECT_UNIVERSITY_STUDENT = (
    "Введите название своего учебного заведения.\n\n"
    "Например: МГУ"
)
SELECT_UNIVERSITY_TEACHER = (
    "Введите название научного учреждения, где Вы ведёте проекты.\n\n"
    "Например: МГУ"
)
FACULTY_TEXT = "Введите ваш факультет"
SPECIALTY_TEXT = "Введите вашу специальность"
DEPARTMENT_TEXT = "Введите вашу кафедру или направление"
ARTICLES_TEXT = "Отправьте ссылки на ваши статьи"
RESEARCH_INTERESTS_TEXT = "Укажите ваши научные интересы"
DEGREE_TEXT = "Введите вашу учёную степень"
SELECT_STAGE_STUDENT = "Укажите, на какой ступени обучения ты сейчас находишься:"
SELECT_STAGE_TEACHER = "Введите свою научную или преподавательскую должность:"
EMAIL_TEXT = "Введите ваш адрес электронной почты"
SUCCESS_TEXT = "✅ Данные успешно сохранены!"